In [25]:
import pandas as pd

df_exams = pd.read_csv('StudentsPerformance.csv')
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [31]:
# using groupby method

group_by_lunch = df_exams.groupby('gender')
group_by_lunch.sum(numeric_only=True)

# the 'numeric_only=True' is very important when dealing with integers

        math score  reading score  writing score
gender
female       32962          37611          37538
male         33127          31558          30516

In [32]:
df_exams.groupby('gender').count()

,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
gender,,,,,,,
female,518,518,518,518,518,518,518
male,482,482,482,482,482,482,482

In [41]:
# agg function in pandas

df_exams.groupby('gender').agg({'math score': ['mean', 'max', 'min', 'count'], 'reading score': ['mean', 'max', 'min', 'count'], 'writing score':  ['mean', 'max', 'min', 'count']})

       math score                reading score                writing score  \
             mean  max min count          mean  max min count          mean
gender
female  63.633205  100   0   518     72.608108  100  17   518     72.467181
male    68.728216  100  27   482     65.473029  100  23   482     63.311203


        max min count
gender
female  100  10   518
male    100  15   482

In [43]:
# grouping multiple columns

df_exams.groupby(['gender', 'race/ethnicity']).mean(numeric_only=True)

                       math score  reading score  writing score
gender race/ethnicity
female group A          58.527778      69.000000      67.861111
       group B          61.403846      71.076923      70.048077
       group C          62.033333      71.944444      71.777778
       group D          65.248062      74.046512      75.023256
       group E          70.811594      75.840580      75.536232
male   group A          63.735849      61.735849      59.150943
       group B          65.930233      62.848837      60.220930
       group C          67.611511      65.424460      62.712230
       group D          69.413534      66.135338      65.413534
       group E          76.746479      70.295775      67.394366

In [ ]:
# shortcut with the describe() function

df_exams.groupby('gender').describe()

       math score                                                       \
            count       mean        std   min   25%   50%   75%    max
gender
female      518.0  63.633205  15.491453   0.0  54.0  65.0  74.0  100.0
male        482.0  68.728216  14.356277  27.0  59.0  69.0  79.0  100.0

       reading score             ...              writing score             \
               count       mean  ...   75%    max         count       mean
gender                           ...
female         518.0  72.608108  ...  83.0  100.0         518.0  72.467181
male           482.0  65.473029  ...  75.0  100.0         482.0  63.311203


              std   min   25%   50%    75%    max
gender
female  14.844842  10.0  64.0  74.0  82.00  100.0
male    14.113832  15.0  53.0  64.0  73.75  100.0

[2 rows x 24 columns]